src/mathematics/linear_algebra/applications/multivariate_analysis.org

#+AUTHOR: Exr0n
* multivariate analysis
** terms
*** null hypothesis
*** dependence - if one set of variables can predict another
*** interdependent analysis - intercorrelations for underlying understanding
*** metric vs non metric - a metric variable is numeric
** then a bunch of methods for dependence analysis
*** pick by matching which ones match your input/output variable types and numbers
** interdependent multivariate analysis
*** factor analysis
**** understand which variables highly correlate to others
***** common factor analysis - extracts factors that correlate
***** principal component analysis - extract factors that have the largest impact
**** clusterananlysis
**** multidimensional scaling
***** obtain tabluar data from a weighted graph structure?
**** corresponding analysis
***** like factor analysis or something?
** important matrices
*** data matrix
*** USSCP
**** data matrix multiplied by the transpose
*** some other thing CSSCP
*** covariance matrix (C)
*** correlation matrix (R)
**** variables normalized for mean 0 and stddev 1
** applications
*** lots of fields
