docs/mathematics/linear_algebra/applications/multivariate_analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Exr0n" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<div id="outline-container-org0e61b28" class="outline-2">
<h2 id="org0e61b28"><span class="section-number-2">1</span> multivariate analysis</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0a9e464" class="outline-3">
<h3 id="org0a9e464"><span class="section-number-3">1.1</span> terms</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org7830d51" class="outline-4">
<h4 id="org7830d51"><span class="section-number-4">1.1.1</span> null hypothesis</h4>
</div>
<div id="outline-container-org2aea69e" class="outline-4">
<h4 id="org2aea69e"><span class="section-number-4">1.1.2</span> dependence - if one set of variables can predict another</h4>
</div>
<div id="outline-container-org449058e" class="outline-4">
<h4 id="org449058e"><span class="section-number-4">1.1.3</span> interdependent analysis - intercorrelations for underlying understanding</h4>
</div>
<div id="outline-container-orge08afcf" class="outline-4">
<h4 id="orge08afcf"><span class="section-number-4">1.1.4</span> metric vs non metric - a metric variable is numeric</h4>
</div>
</div>
<div id="outline-container-orgc6f0728" class="outline-3">
<h3 id="orgc6f0728"><span class="section-number-3">1.2</span> then a bunch of methods for dependence analysis</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0ae905f" class="outline-4">
<h4 id="org0ae905f"><span class="section-number-4">1.2.1</span> pick by matching which ones match your input/output variable types and numbers</h4>
</div>
</div>
<div id="outline-container-org4eba7af" class="outline-3">
<h3 id="org4eba7af"><span class="section-number-3">1.3</span> interdependent multivariate analysis</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb94c57b" class="outline-4">
<h4 id="orgb94c57b"><span class="section-number-4">1.3.1</span> factor analysis</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org56e8f28"></a>understand which variables highly correlate to others<br />
<ol class="org-ol">
<li><a id="org6a4962c"></a>common factor analysis - extracts factors that correlate<br /></li>
<li><a id="org6f19591"></a>principal component analysis - extract factors that have the largest impact<br /></li>
</ol>
</li>
<li><a id="org3788297"></a>clusterananlysis<br /></li>
<li><a id="org6b45893"></a>multidimensional scaling<br />
<ol class="org-ol">
<li><a id="orgba6832c"></a>obtain tabluar data from a weighted graph structure?<br /></li>
</ol>
</li>
<li><a id="orgbc88870"></a>corresponding analysis<br />
<ol class="org-ol">
<li><a id="org87f4e72"></a>like factor analysis or something?<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org63fd5c9" class="outline-3">
<h3 id="org63fd5c9"><span class="section-number-3">1.4</span> important matrices</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org5a1d8cf" class="outline-4">
<h4 id="org5a1d8cf"><span class="section-number-4">1.4.1</span> data matrix</h4>
</div>
<div id="outline-container-org650d1f6" class="outline-4">
<h4 id="org650d1f6"><span class="section-number-4">1.4.2</span> USSCP</h4>
<div class="outline-text-4" id="text-1-4-2">
</div>
<ol class="org-ol">
<li><a id="org26ba84a"></a>data matrix multiplied by the transpose<br /></li>
</ol>
</div>
<div id="outline-container-org12327c9" class="outline-4">
<h4 id="org12327c9"><span class="section-number-4">1.4.3</span> some other thing CSSCP</h4>
</div>
<div id="outline-container-orgdfcebe7" class="outline-4">
<h4 id="orgdfcebe7"><span class="section-number-4">1.4.4</span> covariance matrix (C)</h4>
</div>
<div id="outline-container-orgc3f4f38" class="outline-4">
<h4 id="orgc3f4f38"><span class="section-number-4">1.4.5</span> correlation matrix (R)</h4>
<div class="outline-text-4" id="text-1-4-5">
</div>
<ol class="org-ol">
<li><a id="orgf979ace"></a>variables normalized for mean 0 and stddev 1<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgf5dcfcd" class="outline-3">
<h3 id="orgf5dcfcd"><span class="section-number-3">1.5</span> applications</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org1aa4d8d" class="outline-4">
<h4 id="org1aa4d8d"><span class="section-number-4">1.5.1</span> lots of fields</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Exr0n</span><span class="date">2021-09-11 Sat 16:34</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
