docs/mathematics/linear_algebra/applications/multivariate_analysis.tex
% Created 2021-09-11 Sat 16:42
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\section{multivariate analysis}
\label{sec:orge12a22d}
\subsection{terms}
\label{sec:org6bf6a12}
\subsubsection{null hypothesis}
\label{sec:org96fdc3a}
\subsubsection{dependence - if one set of variables can predict another}
\label{sec:orgd889df5}
\subsubsection{interdependent analysis - intercorrelations for underlying understanding}
\label{sec:orgcddc251}
\subsubsection{metric vs non metric - a metric variable is numeric}
\label{sec:orgea945f6}
\subsection{then a bunch of methods for dependence analysis}
\label{sec:orga7ad8e2}
\subsubsection{pick by matching which ones match your input/output variable types and numbers}
\label{sec:orgf18e2a1}
\subsection{interdependent multivariate analysis}
\label{sec:org00fb98e}
\subsubsection{factor analysis}
\label{sec:org1815a72}
\begin{enumerate}
\item understand which variables highly correlate to others
\label{sec:org2e14c36}
\begin{enumerate}
\item common factor analysis - extracts factors that correlate
\label{sec:org3a6ee67}
\item principal component analysis - extract factors that have the largest impact
\label{sec:orgdccb6dc}
\end{enumerate}
\item clusterananlysis
\label{sec:org8e9c89d}
\item multidimensional scaling
\label{sec:orge86f33e}
\begin{enumerate}
\item obtain tabluar data from a weighted graph structure?
\label{sec:org5a89fcf}
\end{enumerate}
\item corresponding analysis
\label{sec:org1052b8e}
\begin{enumerate}
\item like factor analysis or something?
\label{sec:org00d6dc4}
\end{enumerate}
\end{enumerate}
\subsection{important matrices}
\label{sec:orgec3c4bd}
\subsubsection{data matrix}
\label{sec:orga1e2cc1}
\subsubsection{USSCP}
\label{sec:orgc77d48d}
\begin{enumerate}
\item data matrix multiplied by the transpose
\label{sec:org3fe7502}
\end{enumerate}
\subsubsection{some other thing CSSCP}
\label{sec:org5ef98db}
\subsubsection{covariance matrix (C)}
\label{sec:org983dc21}
\subsubsection{correlation matrix (R)}
\label{sec:orgaa040e0}
\begin{enumerate}
\item variables normalized for mean 0 and stddev 1
\label{sec:org0234186}
\end{enumerate}
\subsection{applications}
\label{sec:org1ea6149}
\subsubsection{lots of fields}
\label{sec:orged0ee2c}
\end{document}
